//ДЗ2 Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет(645->5, 78->третьей цифры нет, 32679->6)
//1
//int Number = new Random().Next(1, 1500);
//System.Console.WriteLine();
//System.Console.WriteLine($"Дано число: {Number}");

//if (Number / 100 > 0) System.Console.WriteLine($"Третьей цифрой числа {Number} является цифра {Number / 100 % 10}");
//else System.Console.WriteLine($"У числа {Number} нет третьей цифры");

//System.Console.WriteLine();

//2
//Console.Write("Введите число: ");
//string input = Console.ReadLine();
//int number = Convert.ToInt32(input);

//int a = number % 10;

//Console.WriteLine("Последняя цифра этого числа: " + a);
